app/Models/CategoryModel.php

SELECT *
FROM `category`
---
    public function getCategory($id = false)
    {
        if ($id == false) {
            return $this->findAll();