app/Models/ContentModel.php

SELECT *
FROM `content`
---
    public function getContent($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();